clear all
clc

% 生成线性序列
t = linspace(0,10,2^16); 

% 生成阶跃信号
dt1 = 2^15;     %延迟时间(单位为点的个数)
A1 = 1;       %信号幅值

y1 = [zeros(dt1,1) ; A1*ones(length(t)-dt1,1)];  %阶跃信号
%注意：如果没有偏移时间，设置dt1为0即可
subplot(4,1,1);
plot(t,y1);
title('阶跃信号');

% 生成方波信号
dt2 = 200;     %延迟时间(单位为点的个数)
A2 = 1;       %信号幅值
T2 = 5;         %周期信号周期
dy2 = 1;      %曲线偏移值

y2 = A2*square(t*2*pi/T2)+dy2;                    %方波信号
%注意：其默认周期为2pi，所以要先乘以2pi，然后再除以T
subplot(4,1,2);
plot(t,y2);
title('方波信号');

% 生成三角波信号
dt3 = 1.25;    %延迟时间(单位为时间)
A3 = 1;       %信号幅值
T3 = 5;         %周期信号周期
dy3 = 1;      %曲线偏移值

y3 = A3*sawtooth((t+dt3)*2*pi/T3, 1/2)+dy3;      %三角波信号
%注意：是先减去偏移时间再乘角频率还是先乘角频率再减得根据实际情况判断
subplot(4,1,3);
plot(t,y3);
title('三角波信号');

% 生正弦波信号
dt4 = 1.25;    %延迟时间(单位为时间)
A4 = 1;       %信号幅值
T4 = 5;         %周期信号周期
dy4 = 1;      %曲线偏移值

y4 = A4*sin((t+dt4)*2*pi/T4)+dy4;                      %正弦波信号
%注意：同样，正弦信号周期默认也是2pi
subplot(4,1,4);
plot(t,y4);
title('正弦波信号');

